package com.jay.lib_algorithm.json_file

/**
 * @author jaydroid
 * @version 1.0
 * @date 2/20/21
 */
object ByteDanceAlgorithmJsonStr {


    /**
     * TODO
     * https://www.nowcoder.com/activity/oj/questions?token=&topicId=117&title=&tags=580&difficulty=0&order=&asc=true&page=1&company=665&_=1613796793952
     *
     * @return
     */
    fun getLinkListJsonStr(): String {

        return "{\n" +
                "  \"msg\": \"OK\",\n" +
                "  \"code\": 0,\n" +
                "  \"data\": {\n" +
                "    \"showExt\": true,\n" +
                "    \"difficultyArray\": [\n" +
                "      {\n" +
                "        \"count\": 7,\n" +
                "        \"id\": 1,\n" +
                "        \"title\": \"入门\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 51,\n" +
                "        \"id\": 2,\n" +
                "        \"title\": \"简单\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 81,\n" +
                "        \"id\": 3,\n" +
                "        \"title\": \"中等\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 18,\n" +
                "        \"id\": 4,\n" +
                "        \"title\": \"较难\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 1,\n" +
                "        \"id\": 5,\n" +
                "        \"title\": \"困难\"\n" +
                "      }\n" +
                "    ],\n" +
                "    \"totalPage\": 1,\n" +
                "    \"questions\": [\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 23286,\n" +
                "        \"questionTitle\": \"反转链表\",\n" +
                "        \"questionNo\": \"NC78\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"客户端\",\n" +
                "            \"id\": 4\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"算法\",\n" +
                "            \"id\": 1\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"前端\",\n" +
                "            \"id\": 3\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"测试\",\n" +
                "            \"id\": 2\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37777,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 2,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 6,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 31.1573,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"小米\",\n" +
                "            \"id\": 147\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"美团\",\n" +
                "            \"id\": 179\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"滴滴\",\n" +
                "            \"id\": 652\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"shopee\",\n" +
                "            \"id\": 1049\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"网易\",\n" +
                "            \"id\": 149\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"猿辅导\",\n" +
                "            \"id\": 758\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"京东\",\n" +
                "            \"id\": 151\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"中兴\",\n" +
                "            \"id\": 664\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"阿里巴巴\",\n" +
                "            \"id\": 134\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"昆仑万维\",\n" +
                "            \"id\": 183\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"BIGO\",\n" +
                "            \"id\": 1019\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"招银网络\",\n" +
                "            \"id\": 914\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"深信服\",\n" +
                "            \"id\": 711\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"微软\",\n" +
                "            \"id\": 146\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"携程\",\n" +
                "            \"id\": 153\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"亚信\",\n" +
                "            \"id\": 706\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"映客\",\n" +
                "            \"id\": 1228\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"华为\",\n" +
                "            \"id\": 239\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"同盾科技\",\n" +
                "            \"id\": 4748\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"奇安信\",\n" +
                "            \"id\": 2227\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"拼多多\",\n" +
                "            \"id\": 732\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"英特尔\",\n" +
                "            \"id\": 650\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"瓜子二手车\",\n" +
                "            \"id\": 915\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"vivo\",\n" +
                "            \"id\": 889\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"哔哩哔哩\",\n" +
                "            \"id\": 935\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"SmartX\",\n" +
                "            \"id\": 2815\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"作业帮\",\n" +
                "            \"id\": 893\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"微博\",\n" +
                "            \"id\": 142\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"去哪儿\",\n" +
                "            \"id\": 141\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"绿湾科技\",\n" +
                "            \"id\": 1128\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"同程艺龙\",\n" +
                "            \"id\": 779\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"斯伦贝谢\",\n" +
                "            \"id\": 1639\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"早稻科技\",\n" +
                "            \"id\": 6932\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"搜狐\",\n" +
                "            \"id\": 148\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"爱奇艺\",\n" +
                "            \"id\": 166\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"欢聚集团\",\n" +
                "            \"id\": 167\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"完美世界\",\n" +
                "            \"id\": 160\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"PingCAP\",\n" +
                "            \"id\": 1622\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"中国农业银行\",\n" +
                "            \"id\": 900\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"微盟\",\n" +
                "            \"id\": 904\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"远景能源\",\n" +
                "            \"id\": 783\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"知乎\",\n" +
                "            \"id\": 963\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"莉莉丝游戏\",\n" +
                "            \"id\": 1648\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"交通银行\",\n" +
                "            \"id\": 1011\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"无端科技\",\n" +
                "            \"id\": 2798\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"贝壳\",\n" +
                "            \"id\": 1008\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"多益网络\",\n" +
                "            \"id\": 800\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"金山云\",\n" +
                "            \"id\": 1003\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"北京国双科技有限公司\",\n" +
                "            \"id\": 1827\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"途虎\",\n" +
                "            \"id\": 1513\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 152,\n" +
                "        \"questionUUid\": \"75e878df47f24fdc9dc3e400ec6058ca\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 605,\n" +
                "        \"questionTitle\": \"判断链表中是否有环\",\n" +
                "        \"questionNo\": \"NC4\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"客户端\",\n" +
                "            \"id\": 4\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"前端\",\n" +
                "            \"id\": 3\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"算法\",\n" +
                "            \"id\": 1\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"测试\",\n" +
                "            \"id\": 2\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37714,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 2,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 4,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 35.9474,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"shopee\",\n" +
                "            \"id\": 1049\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"京东\",\n" +
                "            \"id\": 151\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"多益网络\",\n" +
                "            \"id\": 800\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"滴滴\",\n" +
                "            \"id\": 652\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"酷家乐\",\n" +
                "            \"id\": 705\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"微软\",\n" +
                "            \"id\": 146\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"网易\",\n" +
                "            \"id\": 149\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"唯品会\",\n" +
                "            \"id\": 150\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"360公司\",\n" +
                "            \"id\": 157\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"中兴\",\n" +
                "            \"id\": 664\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"斗鱼\",\n" +
                "            \"id\": 701\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"奇安信\",\n" +
                "            \"id\": 2227\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"绿盟\",\n" +
                "            \"id\": 956\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"CVTE\",\n" +
                "            \"id\": 666\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"招银网络\",\n" +
                "            \"id\": 914\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"招商银行信用卡中心\",\n" +
                "            \"id\": 767\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"小米\",\n" +
                "            \"id\": 147\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"作业帮\",\n" +
                "            \"id\": 893\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"顺丰科技\",\n" +
                "            \"id\": 778\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"深信服\",\n" +
                "            \"id\": 711\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"好未来\",\n" +
                "            \"id\": 710\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"大华\",\n" +
                "            \"id\": 948\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"莉莉丝游戏\",\n" +
                "            \"id\": 1648\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"小鱼易连\",\n" +
                "            \"id\": 4885\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"得物app\",\n" +
                "            \"id\": 4757\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"中国移动\",\n" +
                "            \"id\": 924\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"网易互娱\",\n" +
                "            \"id\": 1063\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 93,\n" +
                "        \"questionUUid\": \"650474f313294468a4ded3ce0f7898b9\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 682,\n" +
                "        \"questionTitle\": \"合并有序链表\",\n" +
                "        \"questionNo\": \"NC33\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"客户端\",\n" +
                "            \"id\": 4\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"测试\",\n" +
                "            \"id\": 2\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"前端\",\n" +
                "            \"id\": 3\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37735,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 2,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 2,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 33.2828,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"华为\",\n" +
                "            \"id\": 239\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"小米\",\n" +
                "            \"id\": 147\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"一点资讯\",\n" +
                "            \"id\": 982\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"招银网络\",\n" +
                "            \"id\": 914\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"京东\",\n" +
                "            \"id\": 151\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"美团\",\n" +
                "            \"id\": 179\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"拼多多\",\n" +
                "            \"id\": 732\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"BIGO\",\n" +
                "            \"id\": 1019\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"微软\",\n" +
                "            \"id\": 146\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"小红书\",\n" +
                "            \"id\": 715\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"猿辅导\",\n" +
                "            \"id\": 758\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"顺丰科技\",\n" +
                "            \"id\": 778\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"网易\",\n" +
                "            \"id\": 149\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"shopee\",\n" +
                "            \"id\": 1049\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"得物app\",\n" +
                "            \"id\": 4757\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"保融科技\",\n" +
                "            \"id\": 1247\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"BOSS直聘\",\n" +
                "            \"id\": 4853\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"kyligence\",\n" +
                "            \"id\": 2106\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 47,\n" +
                "        \"questionUUid\": \"a479a3f0c4554867b35356e0d57cf03d\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 722,\n" +
                "        \"questionTitle\": \"链表中的节点每k个一组翻转\",\n" +
                "        \"questionNo\": \"NC50\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"算法\",\n" +
                "            \"id\": 1\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"客户端\",\n" +
                "            \"id\": 4\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"前端\",\n" +
                "            \"id\": 3\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"测试\",\n" +
                "            \"id\": 2\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37746,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 4,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 2,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 28.3039,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"京东\",\n" +
                "            \"id\": 151\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"CVTE\",\n" +
                "            \"id\": 666\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"猿辅导\",\n" +
                "            \"id\": 758\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"kyligence\",\n" +
                "            \"id\": 2106\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"BIGO\",\n" +
                "            \"id\": 1019\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"美团\",\n" +
                "            \"id\": 179\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"新浪\",\n" +
                "            \"id\": 812\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"猫眼\",\n" +
                "            \"id\": 934\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 38,\n" +
                "        \"questionUUid\": \"b49c3dc907814e9bbfa8437c251b028e\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 604,\n" +
                "        \"questionTitle\": \"链表中环的入口节点\",\n" +
                "        \"questionNo\": \"NC3\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"客户端\",\n" +
                "            \"id\": 4\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"算法\",\n" +
                "            \"id\": 1\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37713,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"双指针\",\n" +
                "            \"id\": 5054\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 3,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 2,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 29.2456,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"网易\",\n" +
                "            \"id\": 149\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"小米\",\n" +
                "            \"id\": 147\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"美团\",\n" +
                "            \"id\": 179\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"映客\",\n" +
                "            \"id\": 1228\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"神策数据\",\n" +
                "            \"id\": 1084\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"网易有道\",\n" +
                "            \"id\": 896\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"拼多多\",\n" +
                "            \"id\": 732\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"探探\",\n" +
                "            \"id\": 1684\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"阿里巴巴\",\n" +
                "            \"id\": 134\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"招银网络\",\n" +
                "            \"id\": 914\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"网易互娱\",\n" +
                "            \"id\": 1063\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 37,\n" +
                "        \"questionUUid\": \"6e630519bf86480296d0f1c868d425ad\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 727,\n" +
                "        \"questionTitle\": \"删除链表的倒数第n个节点\",\n" +
                "        \"questionNo\": \"NC53\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"前端\",\n" +
                "            \"id\": 3\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"客户端\",\n" +
                "            \"id\": 4\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"算法\",\n" +
                "            \"id\": 1\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37750,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"双指针\",\n" +
                "            \"id\": 5054\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 3,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 2,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 28.446,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"美团\",\n" +
                "            \"id\": 179\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"猿辅导\",\n" +
                "            \"id\": 758\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"招银网络\",\n" +
                "            \"id\": 914\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"小米\",\n" +
                "            \"id\": 147\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"携程\",\n" +
                "            \"id\": 153\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"多益网络\",\n" +
                "            \"id\": 800\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"shopee\",\n" +
                "            \"id\": 1049\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"顺丰科技\",\n" +
                "            \"id\": 778\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"拼多多\",\n" +
                "            \"id\": 732\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"中国电信\",\n" +
                "            \"id\": 811\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 34,\n" +
                "        \"questionUUid\": \"f95dcdafbde44b22a6d741baf71653f6\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 1008772,\n" +
                "        \"questionTitle\": \"两个链表生成相加链表\",\n" +
                "        \"questionNo\": \"NC40\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"客户端\",\n" +
                "            \"id\": 4\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"前端\",\n" +
                "            \"id\": 3\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37814,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 3,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 1,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 16.8088,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"shopee\",\n" +
                "            \"id\": 1049\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"华为\",\n" +
                "            \"id\": 239\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"微软\",\n" +
                "            \"id\": 146\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"网易\",\n" +
                "            \"id\": 149\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"作业帮\",\n" +
                "            \"id\": 893\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"猿辅导\",\n" +
                "            \"id\": 758\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"FreeWheel\",\n" +
                "            \"id\": 798\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"美团\",\n" +
                "            \"id\": 179\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 30,\n" +
                "        \"questionUUid\": \"c56f6c70fb3f4849bc56e33ff2a50b6b\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 23257,\n" +
                "        \"questionTitle\": \"两个链表的第一个公共结点\",\n" +
                "        \"questionNo\": \"NC66\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"客户端\",\n" +
                "            \"id\": 4\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"测试\",\n" +
                "            \"id\": 2\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"前端\",\n" +
                "            \"id\": 3\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37761,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 2,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 1,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 34.0035,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"招银网络\",\n" +
                "            \"id\": 914\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"小米\",\n" +
                "            \"id\": 147\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"奇安信\",\n" +
                "            \"id\": 2227\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"网易\",\n" +
                "            \"id\": 149\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"shopee\",\n" +
                "            \"id\": 1049\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"华为\",\n" +
                "            \"id\": 239\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"小红书\",\n" +
                "            \"id\": 715\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 27,\n" +
                "        \"questionUUid\": \"6ab1d9a29e88450685099d45c9e31e46\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 724,\n" +
                "        \"questionTitle\": \"合并k个已排序的链表\",\n" +
                "        \"questionNo\": \"NC51\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"客户端\",\n" +
                "            \"id\": 4\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"算法\",\n" +
                "            \"id\": 1\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"前端\",\n" +
                "            \"id\": 3\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"测试\",\n" +
                "            \"id\": 2\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37747,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"堆\",\n" +
                "            \"id\": 586\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"分治\",\n" +
                "            \"id\": 594\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 4,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 1,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 29.1244,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"猿辅导\",\n" +
                "            \"id\": 758\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"知乎\",\n" +
                "            \"id\": 963\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"度小满\",\n" +
                "            \"id\": 1059\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"网易\",\n" +
                "            \"id\": 149\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"BIGO\",\n" +
                "            \"id\": 1019\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"粉笔网\",\n" +
                "            \"id\": 1759\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"贝壳\",\n" +
                "            \"id\": 1008\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 25,\n" +
                "        \"questionUUid\": \"65cfde9e5b9b4cf2b6bafa5f3ef33fa6\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 1008897,\n" +
                "        \"questionTitle\": \"链表排序\",\n" +
                "        \"questionNo\": \"NC70\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"测试\",\n" +
                "            \"id\": 2\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"算法\",\n" +
                "            \"id\": 1\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"客户端\",\n" +
                "            \"id\": 4\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37817,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"排序\",\n" +
                "            \"id\": 590\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 2,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 1,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 28.1208,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"猿辅导\",\n" +
                "            \"id\": 758\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"美团\",\n" +
                "            \"id\": 179\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"大华\",\n" +
                "            \"id\": 948\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"拼多多\",\n" +
                "            \"id\": 732\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"滴滴\",\n" +
                "            \"id\": 652\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"英特尔\",\n" +
                "            \"id\": 650\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"shopee\",\n" +
                "            \"id\": 1049\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 22,\n" +
                "        \"questionUUid\": \"f23604257af94d939848729b1a5cda08\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 1008769,\n" +
                "        \"questionTitle\": \"判断一个链表是否为回文结构\",\n" +
                "        \"questionNo\": \"NC96\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"算法\",\n" +
                "            \"id\": 1\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"客户端\",\n" +
                "            \"id\": 4\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37813,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"双指针\",\n" +
                "            \"id\": 5054\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 2,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 1,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 28.1364,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"昆仑万维\",\n" +
                "            \"id\": 183\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"网易\",\n" +
                "            \"id\": 149\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"华为\",\n" +
                "            \"id\": 239\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"美团\",\n" +
                "            \"id\": 179\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 15,\n" +
                "        \"questionUUid\": \"3fed228444e740c8be66232ce8b87c2f\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 654,\n" +
                "        \"questionTitle\": \"链表内指定区间反转\",\n" +
                "        \"questionNo\": \"NC21\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37726,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 3,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 1,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 26.3962,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"猿辅导\",\n" +
                "            \"id\": 758\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"小米\",\n" +
                "            \"id\": 147\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"美团\",\n" +
                "            \"id\": 179\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"触宝\",\n" +
                "            \"id\": 1005\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 14,\n" +
                "        \"questionUUid\": \"b58434e200a648c589ca2063f1faf58c\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 663,\n" +
                "        \"questionTitle\": \"删除有序链表中重复出现的元素\",\n" +
                "        \"questionNo\": \"NC24\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"测试\",\n" +
                "            \"id\": 2\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"客户端\",\n" +
                "            \"id\": 4\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37729,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 3,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 1,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 27.1765,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"小米\",\n" +
                "            \"id\": 147\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"微软\",\n" +
                "            \"id\": 146\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"美团\",\n" +
                "            \"id\": 179\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"招银网络\",\n" +
                "            \"id\": 914\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 12,\n" +
                "        \"questionUUid\": \"71cef9f8b5564579bf7ed93fbe0b2024\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 1073463,\n" +
                "        \"questionTitle\": \"链表的奇偶重排\",\n" +
                "        \"questionNo\": \"NC133\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37845,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"排序\",\n" +
                "            \"id\": 590\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 3,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 1,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 43.6937,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"猿辅导\",\n" +
                "            \"id\": 758\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"华为\",\n" +
                "            \"id\": 239\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"腾讯\",\n" +
                "            \"id\": 138\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 12,\n" +
                "        \"questionUUid\": \"02bf49ea45cd486daa031614f9bd6fc3\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 603,\n" +
                "        \"questionTitle\": \"重排链表\",\n" +
                "        \"questionNo\": \"NC2\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"算法\",\n" +
                "            \"id\": 1\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"前端\",\n" +
                "            \"id\": 3\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37712,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 3,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 1,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 20.5881,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"招银网络\",\n" +
                "            \"id\": 914\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"小米\",\n" +
                "            \"id\": 147\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 9,\n" +
                "        \"questionUUid\": \"3d281dc0b3704347846a110bf561ef6b\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 664,\n" +
                "        \"questionTitle\": \"删除有序链表中重复的元素\",\n" +
                "        \"questionNo\": \"NC25\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"测试\",\n" +
                "            \"id\": 2\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37730,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 2,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 1,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 34.948,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"猿辅导\",\n" +
                "            \"id\": 758\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"快手\",\n" +
                "            \"id\": 898\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"paypal\",\n" +
                "            \"id\": 671\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"商汤科技\",\n" +
                "            \"id\": 802\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"招银网络\",\n" +
                "            \"id\": 914\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 9,\n" +
                "        \"questionUUid\": \"c087914fae584da886a0091e877f2c79\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"tpId\": 117,\n" +
                "        \"questionId\": 1008767,\n" +
                "        \"questionTitle\": \"环形链表的约瑟夫问题\",\n" +
                "        \"questionNo\": \"NC132\",\n" +
                "        \"jobs\": [\n" +
                "          {\n" +
                "            \"name\": \"研发\",\n" +
                "            \"id\": 0\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"测试\",\n" +
                "            \"id\": 2\n" +
                "          }\n" +
                "        ],\n" +
                "        \"isNew\": false,\n" +
                "        \"tqId\": 37812,\n" +
                "        \"tags\": [\n" +
                "          {\n" +
                "            \"name\": \"链表\",\n" +
                "            \"id\": 580\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"数学\",\n" +
                "            \"id\": 5050\n" +
                "          }\n" +
                "        ],\n" +
                "        \"difficulty\": 3,\n" +
                "        \"topicUrl\": \"/ta/job-code-high\",\n" +
                "        \"postPage\": 1,\n" +
                "        \"ranks\": \"\",\n" +
                "        \"acceptRate\": 42.5012,\n" +
                "        \"companys\": [\n" +
                "          {\n" +
                "            \"name\": \"用友\",\n" +
                "            \"id\": 782\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"字节跳动\",\n" +
                "            \"id\": 665\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"跟谁学\",\n" +
                "            \"id\": 1065\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"贝壳\",\n" +
                "            \"id\": 1008\n" +
                "          },\n" +
                "          {\n" +
                "            \"name\": \"百度\",\n" +
                "            \"id\": 139\n" +
                "          }\n" +
                "        ],\n" +
                "        \"postCount\": 7,\n" +
                "        \"questionUUid\": \"41c399fdb6004b31a6cbb047c641ed8a\"\n" +
                "      }\n" +
                "    ],\n" +
                "    \"updateTime\": \"2021-01-26 11:04\",\n" +
                "    \"totalCount\": 17,\n" +
                "    \"hiddenTag\": false,\n" +
                "    \"passCount\": 0,\n" +
                "    \"tagArray\": [\n" +
                "      {\n" +
                "        \"count\": 27,\n" +
                "        \"id\": 578,\n" +
                "        \"title\": \"数组\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 26,\n" +
                "        \"id\": 593,\n" +
                "        \"title\": \"动态规划\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 25,\n" +
                "        \"id\": 579,\n" +
                "        \"title\": \"字符串\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 25,\n" +
                "        \"id\": 583,\n" +
                "        \"title\": \"树\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 19,\n" +
                "        \"id\": 580,\n" +
                "        \"title\": \"链表\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 13,\n" +
                "        \"id\": 5051,\n" +
                "        \"title\": \"dfs\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 12,\n" +
                "        \"id\": 5058,\n" +
                "        \"title\": \"二分\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 12,\n" +
                "        \"id\": 5054,\n" +
                "        \"title\": \"双指针\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 10,\n" +
                "        \"id\": 5050,\n" +
                "        \"title\": \"数学\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 9,\n" +
                "        \"id\": 585,\n" +
                "        \"title\": \"哈希\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 9,\n" +
                "        \"id\": 3493,\n" +
                "        \"title\": \"回溯\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 8,\n" +
                "        \"id\": 581,\n" +
                "        \"title\": \"栈\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 7,\n" +
                "        \"id\": 590,\n" +
                "        \"title\": \"排序\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 6,\n" +
                "        \"id\": 594,\n" +
                "        \"title\": \"分治\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 5,\n" +
                "        \"id\": 586,\n" +
                "        \"title\": \"堆\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 5,\n" +
                "        \"id\": 5074,\n" +
                "        \"title\": \"位运算\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 5,\n" +
                "        \"id\": 1263,\n" +
                "        \"title\": \"bfs\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 4,\n" +
                "        \"id\": 592,\n" +
                "        \"title\": \"贪心\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 4,\n" +
                "        \"id\": 595,\n" +
                "        \"title\": \"模拟\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 3,\n" +
                "        \"id\": 591,\n" +
                "        \"title\": \"递归\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 2,\n" +
                "        \"id\": 584,\n" +
                "        \"title\": \"图\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 1,\n" +
                "        \"id\": 582,\n" +
                "        \"title\": \"队列\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 1,\n" +
                "        \"id\": 5166,\n" +
                "        \"title\": \"并查集\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"count\": 1,\n" +
                "        \"id\": 3381,\n" +
                "        \"title\": \"搜索\"\n" +
                "      }\n" +
                "    ]\n" +
                "  }\n" +
                "}"
    }
}